src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ИндивидуальныеПредприниматели</name>
      <description>Индивидуальные предприниматели</description>
    </items>
    <items>
      <name>Иностранные</name>
      <description>Иностранные</description>
    </items>
    <items>
      <name>Российские</name>
      <description>Российские</description>
    </items>
    <items>
      <name>ФизическиеЛица</name>
      <description>Физические лица</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидОрганизации</name>
    <type>
      <types>EnumRef.ВидыОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЛиквидации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииМРП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Деятельность</name>
    <comment>Явл. комментарием по фирме</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеятельностьПрекращена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДатаВыдачи</name>
    <comment>Дата выдачи документа, удостоверяющего личность (для контрагентов - физических лиц)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКемВыдан</name>
    <comment>Организация, выдавшая документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНомер</name>
    <comment>Номер документа, удостоверяющего личность (для контрагентов - физических лиц)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПодчиненностиФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеОрганизации</name>
    <type>
      <types>CatalogRef.НаправленияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНалоговой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистрацииМРП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравоваяФорма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимНалогообложения</name>
    <type>
      <types>EnumRef.РежимыНалогообложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИностраннаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОКВЭД2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Учредители</name>
    <attributes>
      <name>Учредитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКонтактнойИнформации</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОсновныеБанковскиеСчета</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчет</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ВидыКонтрагента/ВидыКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрагента</name>
  <comment>Является ли организация или контрагент юридическим лицом или физическим.</comment>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/БанковскиеСчета/БанковскиеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчета</name>
  <owners>Catalog.Организации</owners>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>НомерСчета</name>
    <comment>Номер расчетного счета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <comment>Дата открытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <comment>Дата закрытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидыБанковскихСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарныйБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьСписаниеВМинус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВладельцаОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПоказыватьВВыборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Организации/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВнутреннийКонтрагент) Тогда
		
		ВнутреннийКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН);
		
		Если НЕ ЗначениеЗаполнено(ВнутреннийКонтрагент) Тогда
			
			СтруктураПараметров = РаботаСКонтрагентами.РеквизитыЮридическогоЛицаПоИНН(ИНН);
			
			КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(КонтрагентОбъект, СтруктураПараметров);
			Если СтрДлина(ИНН) = 10 Тогда
				КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагента.ЮридическоеЛицо;
			ИначеЕсли СтрДлина(ИНН) = 12 Тогда
				КонтрагентОбъект.ВидКонтрагента=Перечисления.ВидыКонтрагента.ИндивидуальныйПредприниматель;
			КонецЕсли;

			ЮридическийАдрес = СтруктураПараметров.ЮридическийАдрес;
			
			Если ЗначениеЗаполнено(ЮридическийАдрес) Тогда
				
				Строки = КонтрагентОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента));
				
				Если Строки.Количество() = 0 Тогда
					ДанныеСтроки = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
				Иначе
					ДанныеСтроки = Строки[0];
				КонецЕсли;
				
				ДанныеСтроки.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
				ДанныеСтроки.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
				ДанныеСтроки.Представление = ЮридическийАдрес.Представление;
				ДанныеСтроки.ЗначенияПолей = ЮридическийАдрес.КонтактнаяИнформация;
				ДанныеСтроки.Представление = ЮридическийАдрес.Представление;
								
			КонецЕсли;
			
			КонтрагентОбъект.ВнутренняяОрганизация = ЭтотОбъект.Ссылка;
			КонтрагентОбъект.Записать();
		
			КонтрагентОбъект.Записать();
			ВнутреннийКонтрагент = КонтрагентОбъект.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВнутреннийКонтрагент) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	БанковскиеСчетаОрганизация.Ссылка КАК СчетОрганизации,
		|	ЕстьNULL(БанковскиеСчетаКонтрагент.Ссылка, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)) КАК СчетКонтрагента
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчетаОрганизация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчетаКонтрагент
		|		ПО БанковскиеСчетаОрганизация.Банк = БанковскиеСчетаКонтрагент.Банк
		|			И БанковскиеСчетаОрганизация.НомерСчета = БанковскиеСчетаКонтрагент.НомерСчета
		|			И (БанковскиеСчетаКонтрагент.Владелец = &Контрагент)
		|ГДЕ
		|	БанковскиеСчетаОрганизация.Владелец = &Организация");
		
		Запрос.УстановитьПараметр("Организация", Ссылка);
		Запрос.УстановитьПараметр("Контрагент", ВнутреннийКонтрагент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(Выборка.СчетКонтрагента) Тогда
				БанковскийСчетКонтрагентаОбъект = Справочники.БанковскиеСчета.СоздатьЭлемент();
			Иначе
				БанковскийСчетКонтрагентаОбъект = Выборка.СчетКонтрагента.ПолучитьОбъект();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(БанковскийСчетКонтрагентаОбъект, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.СчетОрганизации, "Наименование, НомерСчета, Банк, Валютный, ВалютаДенежныхСредств, НомерИДатаРазрешения, ДатаОткрытия, ДатаЗакрытия, ВидСчета, Закрыт"));
			БанковскийСчетКонтрагентаОбъект.Владелец = ВнутреннийКонтрагент;
			БанковскийСчетКонтрагентаОбъект.ПарныйБанковскийСчет = Выборка.СчетОрганизации;
			БанковскийСчетКонтрагентаОбъект.Записать();
			
			СчетОрганизацииОбъект = Выборка.СчетОрганизации.ПолучитьОбъект();
			СчетОрганизацииОбъект.ПарныйБанковскийСчет = БанковскийСчетКонтрагентаОбъект.Ссылка;
			СчетОрганизацииОбъект.Записать();
			
		КонецЦикла;
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнутреннийКонтрагент, "ВнутренняяОрганизация") <> Ссылка Тогда
			
			КонтрагентОбъект = ВнутреннийКонтрагент.ПолучитьОбъект();
			КонтрагентОбъект.ВнутренняяОрганизация = Ссылка;
			КонтрагентОбъект.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
